<template>
<div style="padding:10px">
<h1>《1分钟学会浏览器编程(2021年)》</h1>
<h4>作者:卷毛猪 开始写作日期:2021-5-8 完成写作日期:持续编写中...</h4>

<h2>一、疑惑解答</h2>
<h4>小明 问：“谁可以学会浏览器编程？”</h4>
<h4>卷毛猪🐷 答：“小学、初中、高中以上的同学都可以学会。”</h4>
<h4>小红 问：“学习编程难吗？”</h4>
<h4>卷毛猪🐷 答：“不难，编程就像写作文和画画一样简单，每节课都尽可能保证1分钟学完、1分钟后你自己都可以亲自做实验啦~”</h4>

<h2>二、实验室课程(0到7)</h2>
<h4 @click="to('/0')">0 ---- 在浏览器上显示 你好世界</h4>
<h4 @click="to('/1')">1 ---- 改变 你好世界 的颜色</h4>
<h4 @click="to('/2')">2 ---- 在浏览器上显示一个ok按钮</h4>
<h4 @click="to('/3')">3 ---- 点击ok按钮,弹出窗口并显示你好世界</h4>
<h4 @click="to('/4')">4 ---- 点击ok按钮,把你好世界改为你好中国</h4>
<h4 @click="to('/5')">5 ---- 在浏览器上显示一张图片</h4>
<h4 @click="to('/6')">6 ---- 在浏览器上显示一个视频</h4>
<h4 @click="to('/7')">7 ---- 在浏览器上显示一句话今天天气真好和一个视频，要求今天天气真好和视频为上下结构显示</h4>

<h3>----------------------------------------到这就是学完了，不明白的可以练习作者哦，QQ:1254653278------------------------------------</h3>
</div>
</template>
<script>
export default{
    methods:{
      to(url){
        this.$router.push(url)
      }
    }
}
</script>
<style scoped>
h4{line-height:150%;}
</style>
